[
    {
        "id": 1,
        "name": "Stop",
        "where": "At intersections, railway crossings and scholar patrols.",
        "purpose": "To bring traffic to a stop.",
        "action": "Bring your vehicle to a stop behind the stop line. If there is no stop line, the front of the vehicle must come to a stand still in line with the stop sign. At a three or four-way stop you may not move off before all the other vehicles which stopped before you have moved off. Proceed only when it is safe.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    }, 
    {
        "id": 2,
        "name": "Stop/Yield",
        "where": "At intersections.",
        "purpose": "To allow traffic turning left, to do so (if it can be done without interfering with cross traffic) without stopping.",
        "action": "If you intend to carry straight on, bring your vehicle to a standstill behind the stop line. When turning left, yield to all traffic, which is close enough to pose a hazard. Proceed only when it is safe.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop_yield.png"
    },

    {   
        "id":3,    
        "name": "Minimum Speed Limit",
        "where": "On any road where slow-moving vehicles could disrupt the traffic flow.",
        "purpose": "To regulate the minimum speed of traffic.",
        "action": "Do not drive slower than the speed indicated in km/h.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {   
        "id":4,   
        "name": "Vehicle Exceeding Mass Only",
        "where": "On any public road.",
        "purpose": "To compel drivers of certain heavy vehicles to use the road or part of the road indicated by this road traffic sign.",
        "action": "When driving a vehicle with a Gross Vehicle Mass (GVM) or Gross Combination Mass (GCM) in excess of the mass indicated in tons, use only the part of the road indicated by this sign.\n If the GVM or GCM of your vehicle is less than the mass indicated in tons, use a part of the road not indicated by this sign."
    },
    {
        "id":5,   
        "name": "Keep Left",
        "where": "At obstructions such as traffic islands. Only one of these signs will be displayed at a time.",
        "purpose": "To indicate that you must drive to the left or right of an obstruction where the sign is displayed.",
        "action": "Pass to the left or right of the obstruction, as indicated by the sign.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":6,   
        "name": "Keep Right",
        "where": "Railway Crossings, Intersections, and Scholar Patrols",
        "purpose": "Bring traffic to a stop.",
        "action": "Bring vehicles to a stop behind the line. When there is no stop line, the front of the vehicle must be in line with the stop sign. You may not drive off before all the other vehicles which stopped before you have moved off in a three-way or four-way stop. Continue only when it is safe."
    },
    {
        "id":7,   
        "name": "Switch headlamps on (R133, TR133)",
        "where": "On any road especially in mountainous areas before a tunnel.s",
        "purpose": "To indicate that you must switch on your headlights in order to see and be seen.",
        "action": "Switch the lights of your vehicle on in the dip position.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":8,   
        "name": "Pedestrians Only",
        "where": "At the beginning of any road or part of a road.",
        "purpose": "To indicate that the road or part of the road may be used by pedestrians only.",
        "action": "Do not use the road or part of the road indicated by this sign.\n Pedestrians may use only the part of the road indicated by this sign.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":9,   
        "name": "Buses only (R121, TR121)",
        "where": "At the beginning of any road or part of a road.",
        "purpose": "Indicates that the road or a portion of the road is set aside for use by buses.",
        "action": "The driver of a bus shall on",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":10,   

        "name": "Minibuses only (R119, TR119)",
        "where": "At the beginning of any road or part of a road.",
        "purpose": "Indicates that the road or a portion of the road is set aside for use by minibuses",
        "action": "The driver of a minibus shall only use such road or portion of such road.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":11,   
        "name": "Cyclists only (R111)",
        "where": "At the beginning of any road or part of a road.",
        "purpose": "To indicate that the road or part of the road may be used by cyclists only.",
        "action": "Do not use the road or part of the road indicated by this sign.\n Cyclists may use only the part of the road indicated by this sign.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":12,   

        "name": "Taxis only (R118, TR118)",
        "where": "At the beginning of any road or part of a road.",
        "purpose": "To indicate that the road or portion of the road is set aside for use by taxis.",
        "action": "The driver of the taxi shall use that road.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":13,   
        "name": "Motorcycles only (R116, TR116)",
        "where": "At the beginning of any road or part of a road.",
        "purpose": "Indicate that a road or part of a road may be used by motorcyclists only.",
        "action": "Motorcyclists must follow the route indicated by the road traffic sign.\n No driver of any other vehicle may use the road or part of the road indicated by this sign.\n Motorcyclists may use only that part of the road indicated by this sign."
    },

    { 
        "id":14,     
        "name": "Motor cars only (R117, TR117)",
        "where": "At the beginning of any road or part of a road.",
        "purpose" : "Indicate that a road or part of a road may be used by motorcars only.",
        "action": "You may only drive a motorcar on this road or this part of the road. Where this sign is displayed, you must use that part of the road.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":15,   
        "name": "Goods vehicles only (R123, TR123)",
        "where": "In areas where there is mining and industrial activities taking place.",
        "purpose": "Indicates that the road or portion of the road is set aside for use by goods vehicles",
        "action": "The driver of such goods vehicle shall only use such road or portion of such road.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":16,   
        "name": "Construction vehicles only (R125, TR125)",
        "where": "In areas where there is mining and industrial activities taking place.",
        "purpose": "Indicates that the road or a portion of the road is set aside for use by construction vehicles",
        "action": "The driver of a construction vehicle shall only use such road or portion of such road.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":17,   
        "name": "Abnormal vehicles only (R127, TR127)",
        "where": "In areas where there is mining and industrial activities taking place.",
        "purpose": "Indicates that the road or a portion of the road is set aside for use by abnormal vehicles.",
        "action": "The driver of an abnormal vehicle shall only use such road or portion of such road.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":18,   
        "name": "Roundabout (R137, TR137)",
        "where": "On any road where there are multiple roads intersecting.",
        "purpose": "To indicate that you must move in a clockwise direction at the junction.",
        "action": "Yield right of way to vehicle approaching from the right within the roundabout, where such vehicles are close enough to cause a danger or potential danger. Proceed"
    },
    {
        "id":19,   
        "name": "Pay toll (R132)",
        "where": "On any road.",
        "purpose": "To give you a last opportunity to follow an alternative route, or to proceed on the route and pay toll fees.",
        "action": "Consider both the alternative and the route indicated by this road traffic sign and decide in good time which to follow.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    },
    {
        "id":20,   
        "name": "Agricultural vehicles only (R130, TR130)",
        "where": "In areas where there are farms and other activities that require agricultural vehicles.",
        "purpose": "Indicates that the road or a portion of the road is set aside for use by agricultural vehicles",
        "action": "The driver of an agricultural vehicle shall only use such road or portion of such road.",
        "description": "Description",
        "image": "https://sfamisoftwares.com/api-js/images/stop.png"
    }
]
