[
   {
      "id": 1,
      "name": " Count down signs (IN3, IN2, IN1, TIN3, TIN2, TIN1)(blue-yellow-brown) ",
      "where": " On the left-hand side of any road. ",
      "purpose": " To indicate that there is an exit about 300m, 200m and 100m ahead. ",
      "action": " If possible enter the exit at the same speed as the maximum speed for  that road.",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/count_down_signs.png"
   },
   {
      "id": 1,
      "name": " Cul-de-sac (IN4, IN6, IN5)  ",
      "where": " Displayed on the left-hand side of any road. ",
      "purpose": " To inform you that the road ahead or the road to the left or  right ends. ",
      "action": " Do not turn in at such a road unless you are going to a  destination in the road that ends.",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/cul_de_sac.png"
   },
   {
      "id": 1,
      "name": " Right-of-way (IN7) ",
      "where": " On any road. ",
      "purpose": " To inform you that you have the right of way at the intersection ahead. ",
      "action": " Do not slow down unnecessarily, but make sure that other traffic will  yield. ",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/right_of_way.png"
   },
   {
      "id": 1,
      "name": " Park and ride (IN9, IN10) ",
      "where": " At the entrance to a parking area. ",
      "purpose": " To inform you of the existence of a park-and-ride terminus that has a bus  (IN9) or train (IN10) service. ",
      "action": " Stop in this parking area if you want to reach your destination using other  transport. ",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/park_and_ride.png"
   },
   {
      "id": 1,
      "name": " Supplementary plates (IN11.1, TIN11.2, IN 11.3, TIN11.4, IN11.5) ",
      "where": " Below another sign. ",
      "purpose": " To give more information about the main message on regulatory, warning  or diagrammatical guidance signs. ",
      "action": " Pay attention to these signs in order to realise what the danger is, what a  safe speed is, how far away the danger is and the distance the danger will  continue. Examples:",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/supplementary_plates.png"
   },
   {
      "id": 1,
      "name": "Examples of Supplementary plates",
      "where": " Below another sign. ",
      "purpose": " To give more information about the main message on regulatory, warning  or diagrammatical guidance signs. ",
      "action": " Pay attention to these signs in order to realise what the danger is, what a  safe speed is, how far away the danger is and the distance the danger will  continue. Examples:",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/ex_of_supplementary_plates.png"
   },
   {
      "id": 1,
      "name": " Information centre (IN12) ",
      "where": " Next to the entrance of a parking area or in the top right-hand or top left hand corner of a notice board. ",
      "purpose": " To inform you of the existence of an information office or notice board. ",
      "action": " You can obtain information about the area at this sign.",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/information.png"
   },
   {
      "id": 1,
      "name": " Road experiment (TIN13) ",
      "where": " On the left-hand side of the road. ",
      "purpose": " To inform you of a temporary experiment or research being carried out on the  road. ",
      "action": " Obey all other road traffic signs.  Look out for vehicles, pedestrians and other hazards engaged in the experiment. ",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/road_experiment.png"
   },
   {
      "id": 1,
      "name": " Co-ordinated traffic signals (IN14) ",
      "where": " On the left-hand side of the carriageway before an intersection. ",
      "purpose": " To inform you that the traffic signals on this route are co-ordinated and that the  signals will be green at allthe subsequent intersections if you maintain the  indicated speed. ",
      "action": " If possible maintain the recommended speed. However, make sure that it is safe to  enter every intersection andlook out for drivers that do not yield. The speed  indicated is a recommendation and not a speed limit. ",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/coordinated_traffic_signals.png"
   },
   {
      "id": 1,
      "name": " Multi-phase traffic signals (IN15) ",
      "where": " At intersections at the same pole as traffic signals (robot) under signal head. ",
      "purpose": " To point out that the signals at this intersection does not follow the normal  sequence. At a normal intersectionyou would expect that the signal in your direction will change to green after the signal for cross traffic was yellow. At this intersection your signal may remain red whilst the signal in the opposite direction  changes to green. ",
      "action": " Do not move off when approaching traffic moves off. Wait until the signal is green.  The sequence of the trafficsignals at this intersection can be different during  normal and during peak times.",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/multiphase_traffic_signals.png"
   },
   {
      "id": 1,
      "name": " Bus stop ahead (IN16) ",
      "where": " On the left-hand side of any road. ",
      "purpose": " To indicate that there is a bus stop ahead. ",
      "action": " Be aware that buses may slow down and stop. Look out for pedestrians when  overtaking",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/stop.png"
   },
   {
      "id": 1,
      "name": " Modal transfer (IN17, IN18, IN19) ",
      "where": " On the left-hand side of any road. ",
      "purpose": " To show that there is a transport modal transfer point or terminus nearby where  passengers may change their mode of transport. ",
      "action": " Make sure that it is safe to slow down and stop to drop someone off or pick  someone up. Also look out for pedestrians who may cross the road.",
      "description": "",
      "image": "https://sfamisoftwares.com/api-js/images/information/modal_transfer.png"
   }
]